en/FreeBSD/poudriere-git-repo.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/style.css" />

#+begin_export html
<div class="lang">
<li><a href="poudriere-git-repo.html">en</a>&nbsp;</li>
<li> | <a href="/it/FreeBSD/poudriere-git-repo.html">it</a></li>
</div>
#+end_export


#+begin_export html
<nav class="crumbs">
  <ol>
    <li class="crumb"><a href="/index.html">Home</a></li>
    <li class="crumb">Create poudriere git based repositories</li>
  </ol>
</nav>
#+end_export


#+TITLE: Create poudriere git based repositories
#+OPTIONS: title:nil
#+AUTHOR: https://vieron.info
# Disable super/subscripting 
#+OPTIONS: ^:nil

#+OPTIONS: toc:nil

@@html:<h1 style="text-align: center;">@@Create poudriere git based repositories@@html:</h1>@@
@@html:<h3 style="text-align: center;">@@WARNING: the following are my personal notes. Use at your own risk!@@html:</h3>@@



* Install and configure Poudriere
#+begin_export html
<p><a href="https://docs.freebsd.org/en/books/handbook/ports/#ports-poudriere" target="_blank">https://docs.freebsd.org/en/books/handbook/ports/#ports-poudriere</a></p>
#+end_export

Install Poudriere using the /ports-mgmt/poudriere/ package or port and /devel/ccache/ to use ccache to speed up the build process.

Poudriere configuration file:  ~/usr/local/etc/poudriere.conf~

For ZFS, uncomment ~"#ZPOOL=zroot"~

To enable ccache uncomment ~"#CCACHE_DIR=/var/cache/ccache"~


* Building with Poudriere

** Set git proxy (OPTIONAL)
#+begin_example
# git config --global https.proxy http://localhost:8080
# git config --global http.proxy http://localhost:8080
#+end_example

** Clone a repository

#+begin_export html
<p><a href="https://docs.freebsd.org/en/books/handbook/ports/#ports-using-installation-methods" target="_blank">https://docs.freebsd.org/en/books/handbook/ports/#ports-using-installation-methods</a></p>
#+end_export

#+begin_example
# git clone --depth 1 https://git.FreeBSD.org/ports.git /usr/local/poudriere/ports/local/
#+end_example

** Create poudriere locally managed port tree

#+begin_example
# poudriere ports -c -p local -m null -M /usr/local/poudriere/ports/local/
#+end_example

** Update git repo
#+begin_example
# cd /usr/local/poudriere/ports/local
# git pull
#+end_example


** Create poudriere jail
#+begin_example
# poudriere jail -c -j 13amd64 -v 13.3-RELEASE
#+end_example
** Build with poudriere

Create a list of currently installed prime-origins:
#+begin_example
pkg info -o `pkg prime-list` | awk '{print $2}' | sort > pkg-info-`date +%Y%m%d%H%M`
#+end_example

or

Create a list of all currently installed packages:
#+begin_example
pkg info -o '*' | awk '{print $2}' | sort > pkg-info-`date +%Y%m%d%H%M`
#+end_example



Build packages
#+begin_example
poudriere bulk -j 13amd64-local -p local -f pkg-info-202410041128
#+end_example


* Build routine

** Keep packages updated


Update git repo
#+begin_example
# cd /usr/local/poudriere/ports/local
# git pull
#+end_example

Build packages
#+begin_example
poudriere bulk -j 13amd64-local -p local -f pkg-info-202410041128
#+end_example


** Configure OPTIONS before building (OPTIONAL)

Configure options
#+begin_example
poudriere options -j 13amd64-local -p local -f filename -c
#+end_example

Remove options
#+begin_example
poudriere options -j 13amd64-local -p local -r -f filename
#+end_example


Show options non recursively
#+begin_example
poudriere options -j 13amd64-local -p local -s -f filename -n
#+end_example

** Cleanup old or unwanted packages (OPTIONAL)

Clean all packages
#+begin_example
poudriere pkgclean -A -j 13amd64-local -p local
#+end_example

#+TOC: headlines N

#+begin_export html
<hr>
#+end_export
